Revit.GeometryReferences.ElementFaceReference
A stable reference to a Revit Face, usually derived from a Revit Element
See: http://revitapisearch.com.s3-website-us-east-1.amazonaws.com/html/f3d5d2fe-96bf-8528-4628-78d8d5e6705f.htm